Repository: dgonzalez870/ngx-formcontrol-errors
Catalog: projects/angular-i18n-demo/src/assets/i18n/messages.*.xlf
Languages: es

source: Name
es: Nombre

source: Email
es: Correo Electrónico

source: Reset form
es: Reiniciar formulario

source: This example shows the results of integrating <b><a href="https://github.com/dgonzalez870/ngx-formcontrol-errors#readme">ngx-form-control-errors-msgs</a></b> with <b><a href="https://angular.io/guide/i18n-overview">Angular I18N</a></b>. Choose a language.
es: Este ejemplo presenta el resultado de integrar <b><a href="https://github.com/dgonzalez870/ngx-formcontrol-errors#readme">ngx-form-control-errors-msgs</a></b> con <b><a href="https://angular.io/guide/i18n-overview">Angular I18N</a></b>. Seleccione un idioma.

source: Read the source code <b><a href="https://github.com/dgonzalez870/ngx-formcontrol-errors/tree/main/projects/angular-i18n-demo">here</a></b>
es: Lea el código fuente <b><a href="https://github.com/dgonzalez870/ngx-formcontrol-errors/tree/main/projects/angular-i18n-demo">aquí</a></b>

source: Read the docs <b><a href="https://github.com/dgonzalez870/ngx-formcontrol-errors#readme">here</a></b>
es: Lea la documentación <b><a href="https://github.com/dgonzalez870/ngx-formcontrol-errors#readme">aquí</a></b>

source: This field is required
es: este campo es obligatorio

source: The minimun allowed values is {{min}}
es: El valor mínimo permitido es {{min}}

source: The max allowed value is {{max}}
es: El valor máximo permitido es {{max}}

source: The minimun allowed length is {{requiredLength}}
es: La mínima cantidad de caracteres es {{requiredLength}}

source: The max allowed length is {{requiredLength}}
es: La máxima cantidad de caracteres es {{requiredLength}}

source: Invalid email
es: Correo inválido

source: Invalid pattern
es: Entrada inválida
